function Phi = CwPhi(n, t)
% 状态转移矩阵

nt = n * t;
s = sin(nt);
c = cos(nt);

Phi = [1., 6. * (nt - s),     0.,     (4. * s - 3. * nt) / n, 2. * (1. - c) / n, 0.;
       0., 4. - 3. * c,       0.,     -2. * (1. - c) / n,     s / n,             0.;
       0., 0.,                c,      0.,                     0.,                s / n;
       0., 6. * n * (1. - c), 0.,     4. * c - 3.,            2. * s,            0.;
       0., 3. * n * s,        0.,     -2. * s,                c,                 0.;
       0., 0.,                -n * s, 0.,                     0.,                c];
end