function Phi = CwPhi(n, t)
% 状态转移矩阵

nt = n * t;
s = sin(nt);
c = cos(nt);

Phi = [4. - 3. * c,       0., 0.,     s / n,             2. * (1. - c) / n,      0.;
       6. * (s - nt),     1., 0.,     2. * (c - 1.) / n, (4. * s - 3. * nt) / n, 0.;
       0.,                0., c,      0.,                0.,                     s / n;
       3. * n * s,        0., 0.,     c,                 2. * s,                 0.;
       6. * n * (c - 1.), 0., 0.,     -2. * s,           4. * c - 3.,            0.;
       0.,                0., -n * s, 0.,                0.,                     c];
end